app/controllers/authentications_controller.rb

  def register
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "admin2@admin.com"], ["password_digest", "$2a$10$xrBlTr/y05Xo7VzJ0LS5TeRD7RZ6NIx6ODGHtxbZxcl/rNkOxep5."], ["created_at", 2017-02-16 12:42:53 UTC], ["updated_at", 2017-02-16 12:42:53 UTC]]

  def login
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin2@admin.com"], ["LIMIT", 1]]