app/controllers/contacts_controller.rb

    def set_contact
      @contact = @current_user.contacts.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 AND "contacts"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 0], ["LIMIT", 1]]