app/controllers/periods_controller.rb

SELECT "periods".* FROM "periods"
---
  def index
    @periods = Period.all

INSERT INTO "periods" ("date", "bleeding", "pain", "user_id", "created_at", "updated_at", "notes") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["date", Tue, 21 Feb 2017], ["bleeding", 2], ["pain", 2], ["user_id", 3], ["created_at", 2017-02-21 10:54:22 UTC], ["updated_at", 2017-02-21 10:54:22 UTC], ["notes", "ba"]]
---
  def create
    @period = Period.new(period_params)

    if @period.save

SELECT  "periods".* FROM "periods" WHERE "periods"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_period
      @period = Period.find(params[:id])